---
kind: property
id: P:Autodesk.Revit.DB.Structure.StructuralSettings.BraceAboveSymbol
source: html/c62a04e2-84cd-1458-3ad8-0fe9410d5778.htm
---
# Autodesk.Revit.DB.Structure.StructuralSettings.BraceAboveSymbol Property

The id of the ElementType to represent a brace above a beam in plan view.

## Syntax (C#)
```csharp
public ElementId BraceAboveSymbol { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - When setting this property: A non-optional argument was null